### Import the packages and load the dataset

In [1]:
import pandas as pd
import numpy as np

In [2]:
df=pd.read_csv("https://raw.githubusercontent.com/Premalatha-success/Statistics/main/CardioGoodFitness-1.csv")

### Exploring the dataframe

In [3]:
df.head() # top 5 rows

  Product  Age  Gender  Education MaritalStatus  Usage  Fitness  Income  Miles
0   TM195   18    Male         14        Single      3        4   29562    112
1   TM195   19    Male         15        Single      2        3   31836     75
2   TM195   19  Female         14     Partnered      4        3   30699     66
3   TM195   19    Male         12        Single      3        3   32973     85
4   TM195   20    Male         13     Partnered      4        2   35247     47

In [4]:
df.shape # 180 rows & 9 columns

(180, 9)

In [5]:
df.dtypes # data types of all columns

Product          object
Age               int64
Gender           object
Education         int64
MaritalStatus    object
Usage             int64
Fitness           int64
Income            int64
Miles             int64
dtype: object

In [6]:
df.info() # helps check for null values (if any) and also gives data type of the columns

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 180 entries, 0 to 179
Data columns (total 9 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Product        180 non-null    object
 1   Age            180 non-null    int64
 2   Gender         180 non-null    object
 3   Education      180 non-null    int64
 4   MaritalStatus  180 non-null    object
 5   Usage          180 non-null    int64
 6   Fitness        180 non-null    int64
 7   Income         180 non-null    int64
 8   Miles          180 non-null    int64
dtypes: int64(6), object(3)
memory usage: 12.8+ KB

In [7]:
df.isnull().sum() # Alternative way to find null values, it counts no of null values in each column

Product          0
Age              0
Gender           0
Education        0
MaritalStatus    0
Usage            0
Fitness          0
Income           0
Miles            0
dtype: int64

In [8]:
df.describe() # describing all numerical data columns

,Age,Education,Usage,Fitness,Income,Miles
count,180.000000,180.000000,180.000000,180.000000,180.000000,180.000000
mean,28.788889,15.572222,3.455556,3.311111,53719.577778,103.194444
std,6.943498,1.617055,1.084797,0.958869,16506.684226,51.863605
min,18.000000,12.000000,2.000000,1.000000,29562.000000,21.000000
25%,24.000000,14.000000,3.000000,3.000000,44058.750000,66.000000
50%,26.000000,16.000000,3.000000,3.000000,50596.500000,94.000000
75%,33.000000,16.000000,4.000000,4.000000,58668.000000,114.750000
max,50.000000,21.000000,7.000000,5.000000,104581.000000,360.000000

In [9]:
df[['Product','Gender','MaritalStatus']].describe() # describing non numerical data columns

       Product Gender MaritalStatus
count      180    180           180
unique       3      2             2
top      TM195   Male     Partnered
freq        80    104           107

In [10]:
df['Product'].unique() # list all unique values

array(['TM195', 'TM498', 'TM798'], dtype=object)

In [11]:
df['Product'].value_counts() # Counts no of instances of each product model

TM195    80
TM498    60
TM798    40
Name: Product, dtype: int64

In [12]:
df_single = df[df['MaritalStatus']=='Single'] # dataframe of users who are single

In [13]:
df_single.sample()

,Product,Age,Gender,Education,MaritalStatus,Usage,Fitness,Income,Miles
26,TM195,24,Female,16,Single,4,3,46617,75

In [14]:
len(df[df['Age']>40]) # no of people above 40

12